* Выполнение диплома

** DONE Заполнить задание на диплом

*** DONE Определиться что у меня за устройство
:LOGBOOK:
CLOCK: [2025-02-27 Чт 14:16]--[2025-02-27 Чт 15:10] =>  0:54
:END:

Я решил, что у меня будет полётный контроллер.
*** DONE Выписать ГОСТы, которые подходят
:LOGBOOK:
CLOCK: [2025-02-27 Чт 16:57]--[2025-02-27 Чт 17:21] =>  0:24
:END:

>>> ГОСТы по полётным контроллерам

*** DONE Выписать параметры электронной схемы
:LOGBOOK:
CLOCK: [2025-02-27 Чт 17:37]--[2025-02-27 Чт 18:08] =>  0:31
:END:

*** DONE Отредактировать лист задания
:LOGBOOK:
CLOCK: [2025-02-27 Thu 19:41]--[2025-02-27 Thu 19:54] =>  0:13
:END:

*** DONE Написать письмо Виктору Сильветстровичу.
:LOGBOOK:
CLOCK: [2025-02-27 Thu 19:56]--[2025-02-27 Thu 20:31] =>  0:35
:END:


** DONE Перевод статьи из журнала
:LOGBOOK:
CLOCK: [2025-03-11 Вт 17:43]--[2025-03-11 Вт 17:52] =>  0:09
CLOCK: [2025-03-11 Вт 16:55]--[2025-03-11 Вт 17:39] =>  0:44
:END:

*** Перевод статьи из журнала / режимы работы
:LOGBOOK:
CLOCK: [2025-03-11 Вт 17:53]--[2025-03-11 Вт 18:08] =>  0:15
:END:

*** Перевод статьи из журнала / режимы отображения
:LOGBOOK:
CLOCK: [2025-03-11 Вт 18:13]--[2025-03-11 Вт 18:25] =>  0:12
:END:

*** Перевод статьи из журнала / схема
:LOGBOOK:
CLOCK: [2025-03-11 Вт 18:28]--[2025-03-11 Вт 18:49] =>  0:21
:END:

*** Перевод статьи из журнала / аналоговые входы
:LOGBOOK:
CLOCK: [2025-03-11 Вт 19:18]--[2025-03-11 Вт 19:35] =>  0:17
:END:

*** Перевод статьи из журнала / проблемы с дисплеем
:LOGBOOK:
CLOCK: [2025-03-11 Вт 19:56]--[2025-03-11 Вт 20:14] =>  0:18
:END:

*** Перевод статьи из журнала / выбор режима работы
:LOGBOOK:
CLOCK: [2025-03-11 Вт 20:20]--[2025-03-11 Вт 20:36] =>  0:16
:END:

*** Перевод статьи из журнала / Прочее
:LOGBOOK:
CLOCK: [2025-03-11 Вт 21:04]--[2025-03-11 Вт 21:12] =>  0:08
:END:

*** Перевод статьи из журнала / несколько слов о ПО
:LOGBOOK:
CLOCK: [2025-03-11 Вт 21:18]--[2025-03-11 Вт 21:33] =>  0:15
:END:

*** Перевод статьи из журнала / Использование библиотеки OLED_I2C
:LOGBOOK:
CLOCK: [2025-03-11 Вт 21:37]--[2025-03-11 Вт 21:49] =>  0:12
:END:

*** Перевод статьи из журнала / Перед включением питания и время взлетать
:LOGBOOK:
CLOCK: [2025-03-11 Вт 21:58]--[2025-03-11 Вт 22:00] =>  0:02
CLOCK: [2025-03-11 Вт 21:50]--[2025-03-11 Вт 21:58] =>  0:08
:END:

*** spell check
:LOGBOOK:
CLOCK: [2025-03-11 Вт 22:00]--[2025-03-11 Вт 22:14] =>  0:14
:END:


** Доработка принципиальной схемы



*** DONE Развернуть схему на весь лист А2
:LOGBOOK:
CLOCK: [2025-03-22 Сб 15:57]--[2025-03-22 Сб 16:28] =>  0:31
CLOCK: [2025-03-20 Чт 23:30]--[2025-03-20 Чт 23:59] =>  0:29
CLOCK: [2025-03-19 Ср 21:13]--[2025-03-19 Ср 21:43] =>  0:30
:END:



*** DONE Перерисовать LM3852 как стабилитрон с двумя выводами
:LOGBOOK:
CLOCK: [2025-03-23 Вс 20:04]--[2025-03-23 Вс 20:19] =>  0:15
:END:

*** NGMI Перерисовать стабилизатор напряжени DA1 по ГОСТ
:LOGBOOK:
CLOCK: [2025-03-23 Вс 20:25]--[2025-03-23 Вс 20:39] =>  0:14
:END:



** TODO Придумать как соеденить Э1 и Э3 на одном листе
Cкорей всего с помощью inkscape.

** DONE Доработка структурной схемы
:LOGBOOK:
CLOCK: [2025-03-23 Вс 16:39]--[2025-03-23 Вс 16:51] =>  0:12
CLOCK: [2025-03-23 Вс 16:18]--[2025-03-23 Вс 16:26] =>  0:08
CLOCK: [2025-03-23 Вс 16:00]--[2025-03-23 Вс 16:11] =>  0:11
:END:

** DONE Найти децимальный номер для полётного контроллера
:LOGBOOK:
CLOCK: [2025-03-23 Вс 17:00]--[2025-03-23 Вс 17:33] =>  0:33
:END:

https://prilan.ru/eskd/46/


https://prilan.ru/eskd/46/468/4683/46832/



** TODO Доработка перечня элементов
:LOGBOOK:
CLOCK: [2025-03-23 Вс 22:07]--[2025-03-23 Вс 22:13] =>  0:06
CLOCK: [2025-03-23 Вс 21:37]--[2025-03-23 Вс 21:42] =>  0:05
:END:


** DONE Отчёт по преддипломной практике

*** DONE Вписать ФИО руководителя практики от предприятия

Руководитель:
Острога Дмитрий Викторович

*** DONE Титульный лист с печатью PlaysDev
DEADLINE: <2025-03-21 Пт>

** DONE План-проспект дипломного проекта.

*** DONE План-проспект / прочитать как писать
:LOGBOOK:
CLOCK: [2025-03-25 Вт 12:28]--[2025-03-25 Вт 12:35] =>  0:07
:END:

https://t-j.ru/guide/how-to-plan-diplom/



*** DONE План-проспект / написание плана
:LOGBOOK:
CLOCK: [2025-03-25 Вт 17:46]--[2025-03-25 Вт 17:52] =>  0:06
CLOCK: [2025-03-25 Вт 17:04]--[2025-03-25 Вт 17:22] =>  0:18
CLOCK: [2025-03-25 Вт 16:05]--[2025-03-25 Вт 16:58] =>  0:53
CLOCK: [2025-03-25 Вт 15:25]--[2025-03-25 Вт 15:52] =>  0:27
CLOCK: [2025-03-25 Вт 14:17]--[2025-03-25 Вт 14:21] =>  0:04
CLOCK: [2025-03-25 Вт 13:52]--[2025-03-25 Вт 14:05] =>  0:13
CLOCK: [2025-03-25 Вт 13:11]--[2025-03-25 Вт 13:23] =>  0:12
CLOCK: [2025-03-25 Вт 12:59]--[2025-03-25 Вт 13:10] =>  0:11
CLOCK: [2025-03-25 Вт 12:56]--[2025-03-25 Вт 12:58] =>  0:02
:END:

** DONE Техническое задание
:LOGBOOK:
CLOCK: [2025-03-26 Ср 21:15]--[2025-03-26 Ср 21:40] =>  0:25
CLOCK: [2025-03-26 Ср 20:33]--[2025-03-26 Ср 20:45] =>  0:12
CLOCK: [2025-03-26 Ср 17:33]--[2025-03-26 Ср 17:44] =>  0:11
CLOCK: [2025-03-26 Ср 16:32]--[2025-03-26 Ср 16:39] =>  0:07
CLOCK: [2025-03-26 Ср 16:26]--[2025-03-26 Ср 16:29] =>  0:03
CLOCK: [2025-03-26 Ср 16:16]--[2025-03-26 Ср 16:21] =>  0:05
CLOCK: [2025-03-26 Ср 16:00]--[2025-03-26 Ср 16:14] =>  0:14
CLOCK: [2025-03-26 Ср 15:48]--[2025-03-26 Ср 15:56] =>  0:08
CLOCK: [2025-03-26 Ср 15:43]--[2025-03-26 Ср 15:46] =>  0:03
:END:



** DONE Забрать задание на диплом
:LOGBOOK:
CLOCK: [2025-03-25 Вт 10:58]--[2025-03-25 Вт 12:07] =>  1:09
:END:

Время занявшее у меня сходить до университета пешком, один раз
подъехав на сотом.


** Проектирование

*** Cхема в SimulIDE

*** Компановки печатной платы
**** Компановка печатной платы / 1
**** Компановка печатной платы / 2
**** Компановка печатной платы / 3

*** Корпус печатной платы
**** Герметичный корпус печатной платы
**** Перфорированный корпус печатной платы
** Моделирование
*** Установить
**** COMSOL Multiphysics / Linux
:LOGBOOK:
CLOCK: [2025-03-27 Чт 23:35]--[2025-03-27 Чт 23:53] =>  0:18
:END:

**** Ansys workbench  / Linux

**** COMSOL Multiphysics  / Windows
**** Ansys workbench / Windows

**** Solidworks Simulation
*** Моделирование в программах
**** COMSOL Multiphysics
**** Ansys workbench
**** Solidworks simulation

** Перенос в записку того что ещё можно перенести из курсового
:LOGBOOK:
CLOCK: [2025-03-27 Чт 17:18]--[2025-03-27 Чт 17:19] =>  0:01
CLOCK: [2025-03-27 Чт 16:56]--[2025-03-27 Чт 17:11] =>  0:15
CLOCK: [2025-03-27 Чт 15:57]--[2025-03-27 Чт 16:20] =>  0:23
:END:

** Разделы пояснительной записки диплома
:LOGBOOK:
CLOCK: [2025-03-27 Чт 13:29]--[2025-03-27 Чт 13:54] =>  0:25
CLOCK: [2025-03-27 Чт 13:17]--[2025-03-27 Чт 13:22] =>  0:05
:END:


*** Анализ литературно патентных исследований

**** Обзор методов и средств управления двигателями мультироторных летательных аппаратов
:LOGBOOK:
CLOCK: [2025-03-27 Чт 18:02]--[2025-03-27 Чт 18:15] =>  0:13
CLOCK: [2025-03-27 Чт 15:52]--[2025-03-27 Чт 15:55] =>  0:03
CLOCK: [2025-03-27 Чт 14:13]--[2025-03-27 Чт 14:17] =>  0:04
:END:

**** Анализ патентных исследований

***** Патент 1

***** Патент 2

***** Патент 3

***** Патент 4

***** Патент 5

*** Общетехническое обоснование разработки устройства

**** Анализ исходных данных

**** Формирование основных технических требований к разрабатываемой конструкции

*** Схемотехнический анализ радиоэлектронного средства
**** Описание принципа работы проектируемого радиоэлектронного средства.
**** Расчёт электрических параметров и режимов работы отдельных каскадов проектируемого устройства.
*** Разработка конструкции проектируемого изделия
**** Выбор и обоснование элементной базы
**** Выбор типа электричекского монтажа, элементов крепления и фиксации.
**** Выбор способов обеспечения нормального теплового режима
**** Выбор и обоснование метода изготовления печатной платы
**** Выбор конструкторских решений обеспечивающих удобство ремонта
**** Технология разработки чертежа детали в среде KiCAD
**** Обеспечение требований стандартизации, унификации и технологичности конструкции устройства

*** Расчет параметров проектируемого изделия

**** Расчёт теплового режима.

**** Расчёт на механические воздействия

**** Расчёт конструктивно-технологических параметров печатных плат

**** Расчёт электромагнитной совместимости

**** Полный расчёт надёжности


*** Моделирование физических процессов, протекающих в проектируемом радиоэлектронном средстве

**** Обоснование выбора ПО

**** Компоненты математического обеспечения

**** Технология построения трехмерных моделей исследуемого устройства

**** Технология моделирования тепловых процессов

**** Технология моделирования движения воздуха в корпусах РЭС

**** Обработка, анализ и интерпертация данных

*** Экономическое обоснование.
ЭКОНОМИЧЕСКОЕ ОБОСНОВАНИЕ ВНЕДРЕНИЯ В ЭКСПЛУАТАЦИЮ
ПРОГРАММНО-АППАРАТНОГО КОМПЛЕКСА
https://www.bsuir.by/m/12_100229_1_161144.pdf

>>> экономическое обоснование

| 1) кто будет пользователем Вашей разработки                                                                              | Разработчики БПЛА                     |
| 2) какую проблему этого пользователя она будет решать                                                                    | Проблема управления двигателями       |
| 3) какие существуют конкурентные аналоги и альтернативы                                                                  | TODO                                  |
| 4) почему Ваша разработка окажется для пользователя более предпочтительной по сравнению с этими аналогами/альтернативами | Почему моя разработка предпочтительна |



** Поиск источников
:LOGBOOK:
CLOCK: [2025-03-25 Вт 12:51]--[2025-03-25 Вт 12:54] =>  0:03
:END:

>>> диплом

https://github.com/stars/artsi0m/lists/flight-controller-diploma

** Коммитить изменения в git
:LOGBOOK:
CLOCK: [2025-03-25 Вт 18:14]--[2025-03-25 Вт 18:17] =>  0:03
CLOCK: [2025-03-25 Вт 12:47]--[2025-03-25 Вт 12:48] =>  0:01
CLOCK: [2025-03-25 Вт 12:35]--[2025-03-25 Вт 12:37] =>  0:02
:END:

** Провекра орфографии (spellcheck)
:LOGBOOK:
CLOCK: [2025-03-26 Ср 21:41]--[2025-03-26 Ср 21:50] =>  0:09
CLOCK: [2025-03-25 Вт 17:55]--[2025-03-25 Вт 17:58] =>  0:03
CLOCK: [2025-03-25 Вт 14:11]--[2025-03-25 Вт 14:16] =>  0:05
CLOCK: [2025-03-25 Вт 14:05]--[2025-03-25 Вт 14:07] =>  0:02
:END:

About hunspell on windows:
https://www.gnu.org/software/emacs/manual/html_node/efaq-w32/Spell-check.html

** Форматирование пояснительной записки

*** Ручное форматирование
:LOGBOOK:
CLOCK: [2025-03-25 Вт 18:06]--[2025-03-25 Вт 18:09] =>  0:03
CLOCK: [2025-03-25 Вт 17:59]--[2025-03-25 Вт 18:03] =>  0:04
:END:

*** Доработка latex класса

** Нормоконтроль

*** DONE Написать Ефремовой
:LOGBOOK:
CLOCK: [2025-03-26 Ср 15:07]--[2025-03-26 Ср 15:08] =>  0:01
CLOCK: [2025-03-26 Ср 14:05]--[2025-03-26 Ср 14:08] =>  0:03
:END:


** Исправление недочётов с первой опроцентовки

*** TODO Найти настоящий децимальный номер

*** TODO Увеличить шрифт пинов у микроконтроллера

*** TODO Найти УГО пищалки и если оно отличается, то перерисовать

*** TODO Заменить на структурной схеме Э3 на Э1

*** TODO В перечне убрать строчки в конце листа

*** TODO В перечне штрьевые разъёмы должны обозначаться своим типом

*** TODO Исправить опечатку в целях и назначениях разработки на в ТЗ

*** TODO В ТЗ указать журнал там где слова другая документация

*** TODO В ТЗ 100ВТ заменить на 100 Вт.

*** TODO Выполнить расчёт для тразнистора рядом с пизалко в пункте 3.2

*** TODO Прислать статью из журнала на почту

*** TODO Переанатировать схему

** Переезд записки с xelatex на luatex
